{
  "paintings": [
    {
      "id": 1,
      "description": "American Gothic",
      "link": "art_gallery/american_gothic",
      "artist": "Grant Wood",
      "year": "1930",
      "medium": "Oil on canvas",
      "dimensions": "78 cm × 65.3 cm",
      "location": "Art Institute of Chicago",
      "imageWidth": 800,
      "imageHeight": 1000,
      "aspectRatio": 0.8,
      "story": "This iconic painting depicts a farmer and his daughter standing before a Gothic Revival style house. Wood modeled the house after a real house in Eldon, Iowa, and the figures after his sister Nan Wood Graham and his dentist.",
      "interpretation": "The rigid postures and stern expressions reflect the stoic determination of rural America. The Gothic window behind them creates a religious undertone, suggesting these are people of faith and tradition. The man's pitchfork echoes the window's vertical lines, symbolizing his connection to both the land and moral uprightness. The woman's gaze, slightly averted, hints at suppressed desires or dreams beyond this austere existence.",
      "significance": "A defining image of 20th-century American art, representing the steadfast American pioneer spirit and rural values during the Great Depression."
    },
    {
      "id": 2,
      "description": "The School of Athens",
      "link": "art_gallery/school_of_athens",
      "artist": "Raphael",
      "year": "1509-1511",
      "medium": "Fresco",
      "dimensions": "500 cm × 770 cm",
      "location": "Apostolic Palace, Vatican City",
      "imageWidth": 1200,
      "imageHeight": 900,
      "aspectRatio": 1.33,
      "story": "One of the most famous frescoes by Raphael, painted during the High Renaissance. It depicts the greatest mathematicians, philosophers and scientists from classical antiquity gathered together sharing their ideas. The central figures are Plato and Aristotle.",
      "interpretation": "The composition reveals Raphael's vision of intellectual harmony. Plato points upward to the realm of ideas while Aristotle gestures horizontally toward the empirical world. The architectural perspective draws our eyes to this philosophical dialogue at the center, suggesting that all human knowledge stems from the tension between idealism and realism.",
      "significance": "This masterpiece represents the marriage of art, philosophy, and science during the Renaissance, embodying the humanist ideals of the period."
    },
    {
      "id": 3,
      "description": "Nighthawks",
      "link": "art_gallery/nighthawks",
      "artist": "Edward Hopper",
      "year": "1942",
      "medium": "Oil on canvas",
      "dimensions": "84.1 cm × 152.4 cm",
      "location": "Art Institute of Chicago",
      "imageWidth": 1200,
      "imageHeight": 600,
      "aspectRatio": 2.0,
      "story": "Hopper's most famous painting depicts four people in a downtown diner late at night. The scene captures the isolation and loneliness of urban life in mid-20th century America.",
      "interpretation": "The stark lighting creates a fishbowl effect, making the diner's occupants seem like specimens under observation. The lack of visible entrance heightens the sense of isolation - we can see but never join them. Each figure appears lost in private thoughts, together yet fundamentally alone.",
      "significance": "An iconic representation of urban alienation and the loneliness of modern American life."
    },
    {
      "id": 4,
      "description": "The Death of Socrates",
      "link": "art_gallery/death_of_socrates",
      "artist": "Jacques-Louis David",
      "year": "1787",
      "medium": "Oil on canvas",
      "dimensions": "129.5 cm × 196.2 cm",
      "location": "Metropolitan Museum of Art, New York",
      "imageWidth": 1200,
      "imageHeight": 800,
      "aspectRatio": 1.5,
      "story": "This neoclassical painting depicts the philosopher Socrates about to drink poison hemlock as his death sentence. It shows his final moments surrounded by grief-stricken friends and disciples.",
      "interpretation": "David portrays Socrates as a martyr for philosophy, choosing death over abandoning his principles. The composition emphasizes his moral strength through his upright posture and calm demeanor, contrasting with the emotional collapse of his followers.",
      "significance": "A masterpiece of Neoclassical art that celebrates intellectual courage and moral conviction."
    },
    {
      "id": 5,
      "description": "Girl with a Pearl Earring",
      "link": "art_gallery/girl_with_pearl_earring",
      "artist": "Johannes Vermeer",
      "year": "1665",
      "medium": "Oil on canvas",
      "dimensions": "44.5 cm × 39 cm",
      "location": "Mauritshuis, The Hague",
      "imageWidth": 800,
      "imageHeight": 900,
      "aspectRatio": 0.89,
      "story": "Often called the 'Mona Lisa of the North,' this painting shows a girl with an exotic dress and a large pearl earring. The identity of the subject remains unknown, adding to the painting's mystique.",
      "interpretation": "Vermeer captures a moment of intimate connection between subject and viewer. The girl's direct gaze and slightly parted lips suggest she's about to speak, creating a sense of immediacy and presence that transcends time.",
      "significance": "One of Vermeer's most beloved works, exemplifying his masterful use of light and color."
    },
    {
      "id": 6,
      "description": "The Starry Night",
      "link": "art_gallery/starry_night",
      "artist": "Vincent van Gogh",
      "year": "1889",
      "medium": "Oil on canvas",
      "dimensions": "73.7 cm × 92.1 cm",
      "location": "Museum of Modern Art, New York",
      "imageWidth": 1200,
      "imageHeight": 950,
      "aspectRatio": 1.26,
      "story": "Painted during Van Gogh's stay at the asylum of Saint-Paul-de-Mausole, this painting depicts the view from his east-facing window at the asylum, just before sunrise, with the addition of an idealized village.",
      "interpretation": "The swirling sky represents Van Gogh's turbulent mental state while the cypress tree acts as a flame connecting earth to sky. The peaceful village below contrasts with the cosmic energy above, suggesting the artist's longing for tranquility amid inner turmoil.",
      "significance": "One of the most recognizable paintings in the world, representing Van Gogh's unique post-impressionist style and emotional intensity."
    },
    {
      "id": 7,
      "description": "Wanderer above the Sea of Fog",
      "link": "art_gallery/wanderer_above_sea_fog",
      "artist": "Caspar David Friedrich",
      "year": "1818",
      "medium": "Oil on canvas",
      "dimensions": "94.8 cm × 74.8 cm",
      "location": "Kunsthalle Hamburg",
      "imageWidth": 800,
      "imageHeight": 1000,
      "aspectRatio": 0.8,
      "story": "This Romantic painting shows a lone figure contemplating a landscape shrouded in mist from a rocky precipice. It's become an icon of the Romantic movement and German national identity.",
      "interpretation": "The figure represents the Romantic individual confronting the sublime power of nature. Standing with his back to us, he becomes everyman, inviting us to share his contemplation of the infinite and unknown.",
      "significance": "A defining image of German Romanticism and the relationship between humanity and the natural world."
    },
    {
      "id": 8,
      "description": "The Persistence of Memory",
      "link": "art_gallery/persistence_of_memory",
      "artist": "Salvador Dalí",
      "year": "1931",
      "medium": "Oil on canvas",
      "dimensions": "24 cm × 33 cm",
      "location": "Museum of Modern Art, New York",
      "imageWidth": 1200,
      "imageHeight": 900,
      "aspectRatio": 1.33,
      "story": "This surrealist masterpiece features melting clocks in a dreamscape setting. Dalí was inspired by the theory of relativity and the concept that time is not fixed but relative and can be distorted.",
      "interpretation": "The melting watches suggest that time becomes meaningless in the unconscious world of dreams. The barren landscape and dead tree reflect the persistence of memory even when conscious time dissolves.",
      "significance": "One of the most famous surrealist paintings, exploring themes of time, memory, and the unconscious mind."
    },
    {
      "id": 9,
      "description": "Mona Lisa",
      "link": "art_gallery/mona_lisa",
      "artist": "Leonardo da Vinci",
      "year": "1503-1519",
      "medium": "Oil on poplar panel",
      "dimensions": "77 cm × 53 cm",
      "location": "Louvre Museum, Paris",
      "imageWidth": 800,
      "imageHeight": 1200,
      "aspectRatio": 0.67,
      "story": "The most famous painting in the world, believed to be a portrait of Lisa Gherardini, the wife of a Florentine merchant. Da Vinci worked on it intermittently over many years.",
      "interpretation": "The enigmatic smile and direct gaze create an intimate connection with the viewer. The atmospheric perspective in the background landscape showcases da Vinci's mastery of sfumato technique.",
      "significance": "The epitome of Renaissance portraiture and perhaps the most recognizable artwork in history."
    },
    {
      "id": 10,
      "description": "Vincent Van Gogh",
      "link": "art_gallery/self_portrait_bandaged_ear",
      "artist": "John Russell",
      "year": "1889",
      "medium": "Oil on canvas",
      "dimensions": "60.5 cm × 50 cm",
      "location": "Courtauld Gallery, London",
      "imageWidth": 800,
      "imageHeight": 1000,
      "aspectRatio": 0.8,
      "story": "Painted shortly after Van Gogh's breakdown in which he cut off part of his ear, this self-portrait shows the artist with a bandaged head, capturing a moment of personal crisis.",
      "interpretation": "Despite the trauma represented by the bandage, Van Gogh's steady gaze shows resilience and determination to continue creating. The Japanese print in the background reflects his interest in Eastern art.",
      "significance": "A powerful example of art as therapy and self-expression during mental illness."
    },
    {
      "id": 11,
      "description": "The Creation of Adam",
      "link": "art_gallery/creation_of_adam",
      "artist": "Michelangelo",
      "year": "1508-1512", 
      "medium": "Fresco",
      "dimensions": "280 cm × 570 cm",
      "location": "Sistine Chapel, Vatican City",
      "imageWidth": 1200,
      "imageHeight": 600,
      "aspectRatio": 2.0,
      "story": "Part of Michelangelo's masterwork on the Sistine Chapel ceiling, this scene depicts the Biblical creation narrative from the Book of Genesis in which God gives life to Adam.",
      "interpretation": "The nearly touching hands of God and Adam represent the spark of life and human consciousness. The composition suggests both the divine origin of humanity and human potential for greatness. The space between the fingers represents the gap between the divine and mortal realms.",
      "significance": "One of the most replicated religious paintings in Western art, symbolizing the relationship between Creator and humanity during the High Renaissance."
    },
    {
      "id": 12,
      "description": "Echo and Narcissus",
      "link": "art_gallery/echo_and_narcissus",
      "artist": "John William Waterhouse",
      "year": "1903",
      "medium": "Oil on canvas",
      "dimensions": "109.2 cm × 189.2 cm",
      "location": "Walker Art Gallery, Liverpool",
      "imageWidth": 1200,
      "imageHeight": 700,
      "aspectRatio": 1.71,
      "story": "This painting depicts the Greek myth of Echo and Narcissus. Echo, a nymph who could only repeat what others said, fell in love with Narcissus, who was cursed to fall in love with his own reflection. The painting shows the tragic moment of their parallel but unattainable loves.",
      "interpretation": "Waterhouse captures the melancholy beauty of unrequited love and self-obsession. Echo reaches out desperately while Narcissus is absorbed by his reflection, creating a poignant commentary on connection and isolation. The natural setting reflects the romantic and mystical qualities of the Pre-Raphaelite movement.",
      "significance": "A masterpiece of Pre-Raphaelite art, representing the movement's fascination with classical mythology, natural beauty, and tragic romance."
    }
  ]
}
